IDEA Open Model
TypeCalculationCombiSIA Enumeration
Compatible with IDEA StatiCa 20.1
 Type of combination
 Namespace: IdeaRS.OpenModel.Loading
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public enum TypeCalculationCombiSIA
Public Enumeration TypeCalculationCombiSIA
Members
Member name | Value | Description
Linear | 0 |  Linear combination
Envelope | 1 |  Envelope combination
Code | 2 |  Combination according to code
See Also
Reference
IdeaRS.OpenModel.Loading Namespace